{"":{"language":"es","plural-forms":"nplurals=2; plural=(n != 1);"},"English":"Inglés","French":"Francés","Spanish":"Español","Settings":"Configuración","Language":"Idioma","Aron Elias HERRERA PONTE":"Aron Elias HERRERA PONTE","Lead developer with over 10 years' experience, specializing in frontend development with ReactJS: Web and Mobile.":"Desarrollador líder con más de 10 años de experiencia, especializado en frontend desarrollo con ReactJS: Web y Móvil.","As a senior developer my main objective is to design, develop and maintain web applications. Implement new web technologies that will make the product even more powerful. Find elegant solutions to usability problems. Build fast, intuitive and powerful user interfaces and experiences by solving complex underlying technical challenges.":"Como desarrollador senior mi principal objetivo es diseñar, desarrollar y mantener aplicaciones web. Implementar nuevas tecnologías web que harán que el producto aún más poderoso. Encuentre soluciones elegantes a problemas de usabilidad. Construir interfaces y experiencias de usuario rápidas, intuitivas y potentes al resolver complejos desafíos técnicos subyacentes.","Coordinates":"Coordenadas","Paris - France":"París, Francia","Full LinkedIn profile":"Perfil completo de LinkedIn","Social networks":"Redes sociales","Flowdesk Online Assessment":"Evaluación en línea de Flowdesk","Retrieve and display market data for a selected pair from Binance public API.":"Recuperar y mostrar datos de mercado para un par seleccionado de la API pública de Binance.","Specifications":"Especificaciones","Users should be able to use a form to select the currency pair to query.":"Los usuarios deberían poder utilizar un formulario para seleccionar el par de divisas a consultar.","Upon submitting the form, fetch public market data (ticker, 24h ticker, recent trades) for the selected pair from Binance public REST api.":"Al enviar el formulario, obtenga datos del mercado público (ticker, ticker de 24 horas, operaciones recientes) para el par seleccionado de la API REST pública de Binance.","Users should be able to sort the trades data by time, price & quantity.":"Los usuarios deberían poder ordenar los datos de las operaciones por tiempo, precio y cantidad.","Full documentation & endpoint list are available at":"La documentación completa y la lista de puntos finales están disponibles en","Requirements":"Requisitos","Use React with Typescript":"Usar React con Typescript","You can use any styling solution (at Flowdesk we use styled components)":"Puedes usar cualquier solución de estilo (en Flowdesk usamos componentes con estilo)","You will have to publish your source code in a VCS":"Tendrás que publicar tu código fuente en un VCS.","Good luck!":"¡Buena suerte!","Ticker":"Ticker","Currency pair":"Par de divisas","Select a currency pair":"Seleccione un par de divisas","Submit":"Enviar","Reset":"Reiniciar","Ticker info":"Información del ticker","24h ticker":"24h ticker","Recent trades":"Operaciones recientes","Name":"Nombre","Value":"Valor","Time":"Fecha","Price":"Precio","Quantity":"Cantidad","Quote Qty":"Cantidad de cotización","To sort each column, simply click on the header.":"Para ordenar cada columna, simplemente haga clic en el encabezado.","About":"Acerca de","Contact":"Contacto","Market Data":"Datos del mercado"}