{"":{"language":"fr","plural-forms":"nplurals=2; plural=(n > 1);"},"English":"Anglais","French":"Français","Spanish":"Espagnol","Settings":"Paramètres","Language":"Langue","Aron Elias HERRERA PONTE":"Aron Elias HERRERA PONTE","Lead developer with over 10 years' experience, specializing in frontend development with ReactJS: Web and Mobile.":"Développeur principal avec plus de 10 ans d'expérience, spécialisé dans le frontend développement avec ReactJS : Web et Mobile.","As a senior developer my main objective is to design, develop and maintain web applications. Implement new web technologies that will make the product even more powerful. Find elegant solutions to usability problems. Build fast, intuitive and powerful user interfaces and experiences by solving complex underlying technical challenges.":"En tant que développeur senior, mon objectif principal est de concevoir, développer et maintenirdes applications Web. Implémenter les nouvelles technologies web qui rendront le produit encore plus puissant. Trouvez des solutions élégantes aux problèmes d’utilisabilité. Construire interfaces et expériences utilisateur rapides, intuitives et puissantes en résolvant défis techniques sous-jacents complexes.","Coordinates":"Coordonnées","Paris - France":"Paris - France","Full LinkedIn profile":"Profil LinkedIn complet","Social networks":"Réseaux sociaux","Flowdesk Online Assessment":"Évaluation en ligne Flowdesk","Retrieve and display market data for a selected pair from Binance public API.":"Récupérez et affichez les données de marché pour une paire sélectionnée à partir de l'API publique Binance.","Specifications":"Caractéristiques","Users should be able to use a form to select the currency pair to query.":"Les utilisateurs doivent pouvoir utiliser un formulaire pour sélectionner la paire de devises à interroger.","Upon submitting the form, fetch public market data (ticker, 24h ticker, recent trades) for the selected pair from Binance public REST api.":"Lors de la soumission du formulaire, récupérez les données du marché public (ticker, ticker 24h, transactions récentes) pour la paire sélectionnée à partir de l'API REST publique de Binance.","Users should be able to sort the trades data by time, price & quantity.":"Les utilisateurs devraient pouvoir trier les données des transactions par heure, prix et quantité.","Full documentation & endpoint list are available at":"La documentation complète et la liste des points de terminaison sont disponibles sur","Requirements":"Exigences","Use React with Typescript":"Utiliser React avec Typescript","You can use any styling solution (at Flowdesk we use styled components)":"Vous pouvez utiliser n'importe quelle solution de style (chez Flowdesk, nous utilisons des composants stylisés)","You will have to publish your source code in a VCS":"Vous devrez publier votre code source dans un VCS","Good luck!":"Bonne chance !","Ticker":"Ticker","Currency pair":"Paire de devises","Select a currency pair":"Sélectionnez une paire de devises","Submit":"Envoyer","Reset":"Réinitialiser","Ticker info":"Informations sur le ticker","24h ticker":"24h ticker","Recent trades":"Transactions récentes","Name":"Nom","Value":"Valeur","Time":"Date","Price":"Prix","Quantity":"Quantité","Quote Qty":"Quantité de devis","To sort each column, simply click on the header.":"Pour trier chaque colonne, cliquez simplement sur l'en-tête.","About":"A propos de","Contact":"Contact","Market Data":"Données du marché"}